tests/pyreverse/functional/class_diagrams/annotations/attributes_annotation.dot
digraph "classes" {
rankdir=BT
charset="utf-8"
"attributes_annotation.Dummy" [color="black", fontcolor="black", label=<{Dummy|<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"attributes_annotation.Dummy2" [color="black", fontcolor="black", label=<{Dummy2|alternative_optional : int \| None<br ALIGN="LEFT"/>alternative_optional_swapped : None \| int<br ALIGN="LEFT"/>alternative_union_syntax : str \| int<br ALIGN="LEFT"/>class_attr : list[Dummy]<br ALIGN="LEFT"/>optional : Optional[Dummy]<br ALIGN="LEFT"/>optional_union : Optional[int \| str]<br ALIGN="LEFT"/>param : str<br ALIGN="LEFT"/>union : Union[int, str]<br ALIGN="LEFT"/>|}>, shape="record", style="solid"];
"attributes_annotation.Dummy" -> "attributes_annotation.Dummy2" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="optional", style="solid"];
"attributes_annotation.Dummy" -> "attributes_annotation.Dummy2" [arrowhead="diamond", arrowtail="none", fontcolor="green", label="class_attr", style="solid"];
}
