tests/pyreverse/functional/class_diagrams/annotations/attributes_annotation.mmd
classDiagram
  class Dummy {
  }
  class Dummy2 {
    alternative_optional : int | None
    alternative_optional_swapped : None | int
    alternative_union_syntax : str | int
    class_attr : list[Dummy]
    optional : Optional[Dummy]
    optional_union : Optional[int | str]
    param : str
    union : Union[int, str]
  }
  Dummy "0..1" --* Dummy2 : optional
  Dummy "0..*" --* Dummy2 : class_attr
