tests/pyreverse/functional/class_diagrams/annotations/attributes_annotation.puml
@startuml classes
set namespaceSeparator none
class "Dummy" as attributes_annotation.Dummy {
}
class "Dummy2" as attributes_annotation.Dummy2 {
  alternative_optional : int | None
  alternative_optional_swapped : None | int
  alternative_union_syntax : str | int
  class_attr : list[Dummy]
  optional : Optional[Dummy]
  optional_union : Optional[int | str]
  param : str
  union : Union[int, str]
}
attributes_annotation.Dummy "0..1" --* attributes_annotation.Dummy2 : optional
attributes_annotation.Dummy "0..*" --* attributes_annotation.Dummy2 : class_attr
@enduml
